SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( #D7003B
 Type ( Engine )
 WagonShape ( D7000.s )
 Size ( 15.57618m 3.85613m 15.57618m )
 Mass ( 80t )
 WheelRadius ( 3.591m )
 InertiaTensor ( Box (2.72477m 3.85613m 15.57618m) )
 Coupling (
  Type ( Chain )
  Spring (  comment ( AndiRigidClose1 ) 
   Stiffness ( 0N/m 0N/m )
   Damping ( 0N/m/s 0N/m/s )
   Break ( 500kN 500kN )
   r0 ( 0m 0.02m )
  )
  CouplingHasRigidConnection ( 1 )
  Velocity ( 0.1m/s )
 )
 Coupling (
  Type ( Chain )
  Spring (  comment ( AndiRigidClose1 ) 
   Stiffness ( 0N/m 0N/m )
   Damping ( 0N/m/s 0N/m/s )
   Break ( 500kN 500kN )
   r0 ( 0m 0.02m )
  )
  CouplingHasRigidConnection ( 1 )
  Velocity ( -0.1m/s )
 )
 Buffers (
  Spring (  comment ( stiff2 ) 
   Stiffness ( 1e6N/m 1e7N/m )
   Damping ( 0N/m/s 0N/m/s )
   Break ( 500kN 500kN )
   r0 ( 0m 0.05m )
  )
  Centre ( 0.5 )
  Radius ( 1 )
  Angle ( 1deg )
 ) 
 NumberOfHandbrakeLeverSteps ( 100 )
 MaxHandbrakeForce ( 120kN )
 
 
 Adheasion ( 0.2 0.4 2 0 )
 DerailRailHeight ( 4cm )
 DerailRailForce ( 320kN )
 DerailBufferForce ( 500kN )
 NumWheels ( 12 )
 Friction (
  1028N/m/s 0 0.001m/s 6.58N/m/s 1.98
  0N/rad/s 0 0.001rad/s 30607N/rad/s 0.88
 )
 

 BrakeEquipmentType ( "Vacuum_brake, Triple_valve" )

 BrakeSystemType ( "Vacuum_piped" )
 MaxBrakeForce ( 0N )
 
 EmergencyBrakeResMaxPressure( 110 )
 TripleValveRatio( 2.5 )
 MaxReleaseRate ( 1 )
 MaxApplicationRate ( 1 )
 MaxAuxilaryChargingRate( 20 )
 EmergencyResCapacity( 10 )
 EmergencyResChargingRate( 25 )
 BrakeCylinderPressureForMaxBrakeBrakeForce ( 21 )

 IntakePoint ( 0.0 0.4 FuelDiesel )
 IntakePoint ( 0.0 0.4 FuelDiesel )

 Lights ( 7

  Light (
   comment( marker light right day )
   Type  ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 80ffffff )
     Position ( -0.87 1.72 7.30 )
     Azimuth ( 0 0 0 )
     Transition ( 0 )
     Radius ( 0.5 )
     )
    )
   )
  Light (
   comment( marker light right night )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 80ffffff )
     Position ( -0.87 1.72 7.30 )
     Azimuth ( 0 0 0 )
     Transition ( 0 )
     Radius ( 0.5 )
     )
    )
   )

  Light (
   comment( Number Board right )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 60ff9900 )
     Position ( 0.20 1.8 7.30 )
     Azimuth ( -120 10 10 )
     Transition ( 0 )
     Radius ( .5 )
     )
    )
   )
  Light (
   comment( Number Board Right2 )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 60ff9900 )
     Position ( 0.45 1.8 7.30 )
     Azimuth ( -120 -10 10 )
     Transition ( 0 )
     Radius ( .5 )
     )
    )
   )
  Light (
   comment( Number Board Left )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 60ff9900 )
     Position ( -0.20 1.8 7.30 )
     Azimuth ( -120 -10 10 )
     Transition ( 0 )
     Radius ( .5 )
     )
    )
   )
  Light (
   comment( Number Board Left2 )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 60ff9900 )
     Position ( -0.45 1.8 7.30 )
     Azimuth ( -120 -10 10 )
     Transition ( 0 )
     Radius ( .5 )
     )
    )
   )

  Light (
   comment( Rear right red light )
   Type  ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( aaff0000 )
     Position ( -0.87 1.72 -7.33 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.3 )
     )
    )
   )
  )
 Sound ( "..\\..\\hw_common.sound\\brclass35\\gp38eng.sms" )
 )

Engine ( #D7003B
 Effects
  (
  DieselSpecialEffects
   (
    comment
    (
     the format of these little blocks is as follow:

     offset.x offset.y offset.z
     normal.x normal.y normal.z
     width in metres

     defining the offset from the shape pivot point
     where steam / smoke should appear, the direction
     it should go and the width of the nozzle
    )

    Exhaust1
    (
     0.55 3.80 2.130
     0.20 1 0
     0.04
    )
    Exhaust2
    (
     -0.40 3.80 2.110
     -0.10 1 0
     0.05
    )
   )
         )
        
 Wagon ( #D7003B )
 Type ( Diesel )
 TrainBrakeControllerMinContinuousService ( 0 )
 VacuumBrakesSmallEjectorPowerRating ( 0 )
 VacuumBrakesMinBoilerPressureMaxVacuum ( 0 )
 VacuumBrakesSmallEjectorUsageRate ( 0 )
 VacuumBrakesLargeEjectorUsageRate ( 0 )
 VacuumBrakesHasVacuumPump ( 0 )
 MaxPower ( 1550hp #power at rail 1700hp at crankshaft)
 MaxForce ( 988kN #56,500lbf = 247kN x 4 ) 
 MaxContinuousForce ( 156kN #35,000lbf @ 13.6mph)
 MaxVelocity ( 100mph )
 MaxCurrent ( 6000A  ) 
 WheelRadius ( 3.591m )
 comment( sanding system is switched off when faster than given velocity )
 Sanding ( 1e9mph )

 NumWheels ( 1 )
 MaxTemperature ( 120 )
 MaxOilPressure ( 90 )

 MaxDieselLevel ( 890gal )
 DieselUsedPerHourAtMaxPower ( 93gal )
 DieselUsedPerHourAtIdle ( 6.4gal )

 AirBrakesAirCompressorPowerRating( 1.2 )
 AirBrakesMainMinResAirPressure( 0 )
 AirBrakesMainMaxAirPressure( 90 )
 AirBrakesMainResVolume( 8 )
 AirBrakesAirCompressorWattage( 19000 )
 AirBrakesCompressorRestartPressure( 87 )
 AirBrakesAirUsedPerPoundsOfBrakePipePressure( 0.22 )
 AirBrakesIsCompressorElectricOrMechanical( 1 )

 EngineBrakesControllerMinPressureReduction( 6 )
 TrainBrakesControllerMinPressureReduction( 6 )
 EngineBrakesControllerHasProportionalBrake( 1 )
 EngineBrakesProportionalBrakeLag( 0.9 )
 EngineBrakesControllerMaxApplicationRate( 20 )
 TrainBrakesControllerMaxApplicationRate ( 1 )
 EngineBrakesControllerMaxReleaseRate( 15 )
 TrainBrakesControllerMaxReleaseRate ( 1 )
 EngineBrakesControllerEmergencyApplicationRate( 50 )
 TrainBrakesControllerEmergencyApplicationRate ( 1 )
 EngineBrakesControllerMinSystemPressure ( 0 )
 TrainBrakesControllerMinSystemPressure ( 0 )
 EngineBrakesControllerMaxSystemPressure ( 21 )
 TrainBrakesControllerMaxSystemPressure ( 21 )
 EngineBrakesControllerEmergencyBrakeTimePenalty( 60 )
 TrainBrakesControllerEmergencyBrakeTimePenalty( 60 )
 EngineBrakesControllerFullServicePressureDrop( 26 )
 TrainBrakesControllerFullServicePressureDrop( 26 )


 DynamicBrakesMinUsableSpeed( 5 )
 DynamicBrakesMaximumEffectiveSpeed( 25 )
 DynamicBrakesMaximumForce( 20000 )
 DynamicBrakesResistorCurrentLimit ( 5000 )
 DynamicBrakesCutInSpeed( 8 )
 DynamicBrakesMaxAirBrakePressure ( 15 )
 DynamicBrakesFadingSpeed( 25 )
 DynamicBrakesDelayTimeBeforeEngaging ( 10 )
 DynamicBrakesMaximumSpeedForFadeOut ( 65 )
 DynamicBrakesEffectAtMaximumFadeOut( 0 )
 DynamicBrakesHigherSpeedCurveExponent( 1 )
 DynamicBrakesLowerSpeedCurveExponent( 1 )
 DynamicBrakesNumberOfControllerNotches( 10 )


 BrakesEngineBrakeType ( "Vacuum_single_pipe" )
 BrakesTrainBrakeType ( "Vacuum_single_pipe" )
        BrakesEngineControllers ( "Independent,Train" )
        
        EngineBrakesControllerDirectControlExponent ( 1.5 )

 MaxDieselLevel ( 890gal )

 DieselSmokeEffectInitialMagnitude( 0.5 )
 DieselSmokeEffectMaxMagnitude( 2.0 )
 DieselSmokeEffectInitialSmokeRate( 2.0 )
 DieselSmokeEffectMaxSmokeRate( 10.0 ) 
 
 DieselEngineIdleRPM( 650 )
 DieselEngineMaxRPM( 1500 )
 DieselEngineSpeedOfMaxTractiveEffort( 9.1mph )        
        DieselEngineMaxRPMChangeRate( 200 )

 DoesHornTriggerBell( 0 )

 EmergencyStopMonitor(
      MonitoringDeviceMonitorTimeLimit( 0 )
      MonitoringDeviceAlarmTimeLimit( 0 )
      MonitoringDevicePenaltyTimeLimit( 0 )
      MonitoringDeviceCriticalLevel( 0 )
      MonitoringDeviceResetLevel( 0 )
      MonitoringDeviceAppliesFullBrake( 0 )
      MonitoringDeviceAppliesEmergencyBrake( 1 )
      MonitoringDeviceAppliesCutsPower( 0 )
      MonitoringDeviceAppliesShutsDownEngine( 0 )
      )

 AWSMonitor(
  MonitoringDeviceMonitorTimeLimit( -1 )
  MonitoringDeviceAlarmTimeLimit( 5 )
  MonitoringDevicePenaltyTimeLimit( 0 )
  MonitoringDeviceCriticalLevel( 0 )
  MonitoringDeviceResetLevel( 0 )
  MonitoringDeviceAppliesFullBrake( 0 )
  MonitoringDeviceAppliesEmergencyBrake( 1 )
  MonitoringDeviceAppliesCutsPower( 0 )
  MonitoringDeviceAppliesShutsDownEngine( 0 )
  )
 
 EngineVariables( 3600 )
   
       EngineControllers (
            Throttle ( 0 1 0.025 0
                NumNotches ( 1
                    Notch( 0  1 Dummy )
                )
            )
            Brake_Engine ( 0 1 0.04 0 
                NumNotches ( 1
                    Notch( 0  1 Dummy )
                )
            )
            Brake_Train ( 0 1 0.025 0.75 
                NumNotches ( 5
                    Notch( 0    0 TrainBrakesControllerReleaseStart )
                    Notch( 0.3  1 TrainBrakesControllerGraduatedSelfLapLimitedHoldingStart )
                    Notch( 0.85 0 TrainBrakesControllerSuppressionStart )
                    Notch( 0.9  0 TrainBrakesControllerContinuousServiceStart )
                    Notch( 0.95 0 TrainBrakesControllerEmergencyStart )
                )
            )
            DirControl ( -1 0 1 1 )
            BellToggle( 0 1 0 )
            AWS ( 0 1 0 )
            Sanding ( 0 1 0 )
            Horn ( 0 1 0 )
            Wipers ( 0 1 0 )
            EmergencyStopResetToggle( 0 1 0 )
            EmergencyStopToggle( 0 1 0 )
            Vigilance ( 0 1 0 )
            Headlights ( 0 0.25 1 0 )
            BailOffButton( 0 1 0 )
        )
        
     Name ( "BR HW - # Class 35 Hymek - D7003  (bogey-compatible)" )
  Description ("D7003 1.700hp Diesel Hydraulic, "+
 "Model copyright(c) Chris Baily May 2003\n"+
 "Version 1.0 \n"+
 "Provided as freeware.\n\n"
  )

 EngineOperatingProcedures (
 "To move forward\n"+
 "1. Press the W key to move the Reverser to Forward.\n"+
 "2. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "3. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n"+
 "4. Press the D key to move the throttle from Idle. DO NOT EXCEED 1500 Amps on Ammeter\n"+  
 "5. Gradually increase power (D key) until your train reaches the desired speed.\n\n"+
 "To slow the train\n"+
 "1. Press the A key to close the throttle.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+  
 "To apply the train brakes\n"+
 "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n\n"+
 "To bail off the train brakes on the locomotive\n"+
 "1. Press the / (FORWARD SLASH) key.\n\n"+
 "To release the train brakes\n"+
 "1. Press the ; (SEMICOLON) key to release the train brakes.\n\n"+
 "To apply the locomotive brake\n"+
 "1. Press the ] (RIGHT BRACKET) key to apply the locomotive brake.\n\n"+
 "To release the locomotive brake\n"+
 "1. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n\n"+
 "To activate emergency braking\n"+
 "1. Press the A key to reduce the throttle to Idle.\n"+
 "2. Press the BACKSPACE key to activate emergency braking.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+ 
 "2. Press the S key to move the Reverser to the Reverse position.\n"+
 "4. Release the brakes.\n"+
 "5. Slowly advance the throttle lever (D key).\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 2 mph.\n"+
 "TIP: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window."     ) 
)

